app/Helpers/AppHelper.php

    public static function getAuthUserCompanyId(): int
    {
        $user = auth()->user();

        if ($user) {
            $companyId = optional($user)->company_id;
            if (!$companyId) {
                throw new Exception('User Company Id not found', 401);
            }
        }else{
            $companyId = Company::first()->id;
---
select * from `companies` limit 1

    public static function getCompanyLogo()
    {
        $company = Company::select('logo')->first();
---
select `logo` from `companies` limit 1

    public static function check24HoursTimeAppSetting(): bool
    {
        $slug = '24-hour-format';
        return AppSetting::where('slug', $slug)->where('status', 1)->exists();
---
select exists(select * from `app_settings` where `slug` = '24-hour-format' and `status` = 1) as `exists`

    public static function ifDateInBsEnabled(): bool
    {
        $slug = 'bs';
        return AppSetting::where('slug', $slug)->where('status', 1)->exists();
---
select exists(select * from `app_settings` where `slug` = 'bs' and `status` = 1) as `exists`

    public static function ifAttendanceNoteEnabled(): bool
    {
        $slug = 'attendance_note';
        return AttendanceSetting::where('slug', $slug)->where('status', 1)->exists();
---
select exists(select * from `attendance_settings` where `slug` = 'attendance_note' and `status` = 1) as `exists`

    public static function ifAttendanceMapEnabled(): bool
    {
        $slug = 'attendance_map';
        return AttendanceSetting::where('slug', $slug)->where('status', 1)->exists();
---
select exists(select * from `app_settings` where `slug` = 'enable-employee-location' and `status` = 1) as `exists`

   public static function attendanceMethod()
    {
        $slug = 'attendance_method';
        return AttendanceSetting::where('slug', $slug)->pluck('values')->first() ?? [];
---
select `values` from `attendance_settings` where `slug` = 'attendance_method'

    public static function getAttendanceLimit():int
    {
        return AttendanceSetting::where('slug', 'attendance_limit')->pluck('value')->first();
---
select `value` from `attendance_settings` where `slug` = 'attendance_limit'

    public static function getAllRoleIdsWithGivenPermission($permissionKey): array
    {

        return DB::table('permission_roles')
            ->leftJoin('permissions', function ($query) {
                $query->on('permission_roles.permission_id', '=', 'permissions.id');
            })
            ->Join('roles', function ($query) {
                $query->on('roles.id', '=', 'permission_roles.role_id')
                    ->where('roles.is_active',self::IS_ACTIVE);
            })
            ->where('permissions.permission_key', $permissionKey)
            ->pluck('permission_roles.role_id')
            ->toArray();
---
select `permission_roles`.`role_id` from `permission_roles` left join `permissions` on `permission_roles`.`permission_id` = `permissions`.`id` inner join `roles` on `roles`.`id` = `permission_roles`.`role_id` and `roles`.`is_active` = 1 where `permissions`.`permission_key` = 'employee_check_in'

    public static function checkRoleIdWithGivenPermission($roleId, $permissionKey)
    {
        $hasPermission =  DB::table('permission_roles')
            ->join('permissions', 'permission_roles.permission_id', '=', 'permissions.id')
            ->join('roles', function ($join) use ($roleId) {
                $join->on('roles.id', '=', 'permission_roles.role_id')
                    ->where('roles.id', $roleId)
                    ->where('roles.is_active', self::IS_ACTIVE);
            })
            ->where('permissions.permission_key', $permissionKey)
            ->first();
---
select * from `permission_roles` inner join `permissions` on `permission_roles`.`permission_id` = `permissions`.`id` inner join `roles` on `roles`.`id` = `permission_roles`.`role_id` and `roles`.`id` = 2 and `roles`.`is_active` = 1 where `permissions`.`permission_key` = 'create_nfc' limit 1