app/Helpers/AttendanceHelper.php

    public static function isHolidayOrWeekendOnCurrentDate(): bool
    {
        $date = Carbon::today()->format('Y-m-d');
        $holiday = Holiday::whereDate('event_date', $date)->where('is_active',1)->count();

        if ($holiday == 0) {
            $weekDay = self::getWeekDayInNumber($date);
            $weekend = Company::whereJsonContains('weekend', $weekDay)->count();
---
select count(*) as aggregate from `holidays` where date(`event_date`) = '2026-04-17' and `is_active` = 1
select count(*) as aggregate from `companies` where json_contains(`weekend`, '\"5\"')

//                ->where('attendances.user_id', $userId)
//                ->get();

            $worked_time = Attendance::selectRaw('
                    COUNT(DISTINCT attendance_date) AS present_days,
                    SUM(overtime) AS total_overtime,
                    SUM(undertime) AS total_undertime,
                    SUM(worked_hour) AS total_minutes
                ')
                ->where('attendance_status', 1)
                ->whereBetween('attendance_date', [$startDate, $endDate])
                ->where('user_id', $userId)
                ->get();
---
select
COUNT(DISTINCT attendance_date) AS present_days,
SUM(overtime) AS total_overtime,
SUM(undertime) AS total_undertime,
SUM(worked_hour) AS total_minutes
from `attendances` where `attendance_status` = 1 and `attendance_date` between '2026-04-01' and '2026-04-30' and `user_id` = 412 and exists (select * from `users` where `attendances`.`user_id` = `users`.`id` and `branch_id` = 2 and `users`.`deleted_at` is null)


//            $holidayCount = Holiday::whereBetween('event_date',[$startDate, $endDate])->count();

            $holidayCounts = Holiday::whereBetween('event_date', [$startDate, $endDate])
                ->selectRaw('COUNT(*) AS total_count, SUM(DAYOFWEEK(event_date) = 7) AS weekend_count')
                ->first();
---
select COUNT(*) AS total_count, SUM(DAYOFWEEK(event_date) = 7) AS weekend_count from `holidays` where `event_date` between '2026-04-01' and '2026-04-30' limit 1


            $weekendCount = $weekendCount - $weekendHolidayCount;

            $shift = User::select(
                DB::raw("
                    TIME_FORMAT(
                        TIMEDIFF(
                            CASE
                                WHEN office_times.shift_type = 'night'
                                THEN ADDTIME(office_times.closing_time, '24:00:00')
                                ELSE office_times.closing_time
                            END,
                            office_times.opening_time
                        ),
                        '%l'
                        ) as hours
                    ")
            )
                ->leftJoin('office_times', function ($join) {
                    $join->on('users.office_time_id', '=', 'office_times.id')
                        ->where('office_times.is_active', '=', 1);
                })
                ->where('users.id', $userId)
                ->first();
---
select
TIME_FORMAT(
TIMEDIFF(
CASE
WHEN office_times.shift_type = 'night'
THEN ADDTIME(office_times.closing_time, '24:00:00')
ELSE office_times.closing_time
END,
office_times.opening_time
),
'%l'
) as hours
from `users` left join `office_times` on `users`.`office_time_id` = `office_times`.`id` and `office_times`.`is_active` = 1 where `users`.`id` = 412 and `users`.`deleted_at` is null limit 1

    public static function countWeekdaysInMonth($startDate, $endDate): int
    {
        $companyWeekend = Company::pluck('weekend')->first();
---
select `weekend` from `companies`

    public static function getOverAndUnderTimeData($attendance)
    {
        $workingHourMin = 0;
        $underTime = 0;
        $overTime = 0;
        $isUnderTime = false;
        $isOverTime = false;

        $shift = User::
        select(
            'office_times.closing_time', 'office_times.opening_time'
        )
            ->leftJoin('office_times', function ($join) {
                $join->on('users.office_time_id', '=', 'office_times.id')
                    ->where('office_times.is_active', '=', 1);
            })
            ->where('users.id', $attendance->user_id)->first();
---
select `office_times`.`closing_time`, `office_times`.`opening_time` from `users` left join `office_times` on `users`.`office_time_id` = `office_times`.`id` and `office_times`.`is_active` = 1 where `users`.`id` = 412 and `users`.`deleted_at` is null limit 1