app/Helpers/user_helper.php

    function getRecordPerPage()
    {
        static $recordsPerPage = null;
        if ($recordsPerPage !== null) {
            return $recordsPerPage;
        }

        $key = 'records_per_page';
        $limit = \App\Models\GeneralSetting::query()->where('key', $key)->first();
---
select * from `general_settings` where `key` = 'records_per_page' limit 1