app/Repositories/AppSettingRepository.php

    public function findAppSettingDetailBySlug($slug)
    {
        return AppSetting::where('slug',$slug)->first();
---
select * from `app_settings` where `slug` = 'authorize-login' limit 1