app/Repositories/AttendanceLogRepository.php

select * from `attendance_logs` where `employee_id` = 99 and exists (select * from `users` where `attendance_logs`.`employee_id` = `users`.`id` and `branch_id` = 1 and `users`.`deleted_at` is null) limit 1
---
    public function getAllBiometricLogs($filterData)
    {
        return BiometricAttendanceLog::with(['user'])
            ->whereHas('user', function ($query) {
                $query->where('is_active', 1);
            })
            ->when(isset($filterData['branch_id']) && $filterData['branch_id'] !== '', function ($query) use ($filterData) {
                $query->whereHas('user', function ($query) use ($filterData) {
                    $query->where('branch_id', $filterData['branch_id']);
                });
            })
            ->when(isset($filterData['department_id']) && $filterData['department_id'] !== '', function ($query) use ($filterData) {
                $query->whereHas('user', function ($query) use ($filterData) {
                    $query->where('department_id', $filterData['department_id']);
                });
            })
            ->when(isset($filterData['employee_id']) && $filterData['employee_id'] !== '', function ($query) use ($filterData) {
                $query->where('employee_id', $filterData['employee_id']);
            })
            ->when(isset($filterData['attendance_status']) && $filterData['attendance_status'] !== '', function ($query) use ($filterData) {
                $query->where('attendance_status', $filterData['attendance_status']);
            })
            ->when(isset($filterData['date']) && $filterData['date'] !== '', function ($query) use ($filterData) {
                $query->whereDate('timestamp', $filterData['date']);
            })
            ->latest('id')
            ->paginate(BiometricAttendanceLog::RECORDS_PER_PAGE);

update `attendance_logs` set `attendance_logs`.`updated_at` = '2026-04-17 08:05:21' where `id` = 85
---
    public function updateAttendanceLog($attendanceLogDetail, $validatedData)
    {
        $attendanceLogDetail->update($validatedData);