app/Repositories/BranchRepository.php

    public function findBranchDetailById($id,$with=[]):mixed
    {
        return Branch::with($with)->where('id',$id)->first();
---
select * from `branches` where `id` = 1 and `id` = 1 limit 1