app/Repositories/DepartmentRepository.php

            ->get()
            ->groupBy('dept_name');

        $items = $paginatedNames->getCollection()->map(function ($row) use ($departmentsGrouped) {
            $group = $departmentsGrouped->get($row->dept_name, collect());
            $first = $group->first() ?? new Department();

            $mergedEmployees = $group->flatMap->employees->unique('id')->values();
            $branches = $group->pluck('branch')->filter()->unique('id')->values();
            $isActive = $group->contains(fn ($d) => (int)$d->is_active === 1) ? 1 : 0;
            $head = $group->pluck('departmentHead')->filter()->first();

            $dept = clone $first;
            $dept->id = $row->max_id;
            $dept->dept_name = $row->dept_name;
            $dept->setRelation('branch', $branches->first());
            $dept->setRelation('branches', $branches);
            $dept->setRelation('employees', $mergedEmployees);
            $dept->employees_count = $mergedEmployees->count();
            $dept->setRelation('departmentHead', $head);
            $dept->is_active = $isActive;

            return $dept;
        });
---
select `dept_name`, `id` from `departments` where `is_active` = 1 and `branch_id` = '1' and exists (select * from `branches` where `departments`.`branch_id` = `branches`.`id` and `id` = 1 and `id` = 1)