app/Repositories/FeatureRepository.php

    public function getAllFeatures($select=['*'])
    {
        return Feature::select($select)->orderBy('group','desc')->orderBy('name')->get();
---
select * from `features` order by `group` desc, `name` asc