app/Repositories/HolidayRepository.php

select `event_date` from `holidays` where `is_active` = 1 and `event_date` between '2026-04-17' and '2026-04-24'
---
    public function getAllActiveHolidaysBetweenGivenDates($nowDate,$toDate)
    {
        return Holiday::where('is_active', 1)
            ->whereBetween('event_date', [$nowDate, $toDate])
            ->pluck('event_date')
            ->toArray();

select * from `holidays` where `is_active` = 1 and date(`event_date`) >= '2026-04-17' order by `event_date` asc limit 1
---
    public function getRecentActiveHoliday()
    {

        $nowDate = Carbon::now()->format('Y-m-d');
        return  Holiday::where('is_active', 1)
            ->whereDate('event_date', '>=', $nowDate)
            ->orderBy('event_date')
            ->first();