app/Repositories/LeaveTypeRepository.php

    public function getGenderSpecificPaidLeaveTypes($branchId,$gender)
    {
        return LeaveType::whereNotNUll('leave_allocated')
            ->where('branch_id',$branchId)
            ->where(function ($query) use ($gender) {
                $query->where('gender', $gender)
                    ->orWhere('gender', LeaveGenderEnum::all->value);
            })
            ->select('name','id')
            ->orderBy('id')
            ->get();
---
select `name`, `id` from `leave_types` where `leave_allocated` is not null and `branch_id` = 2 and (`gender` = 'male' or `gender` = 'all') order by `id` asc