app/Repositories/NotificationRepository.php

    public function getAllCompanyRecentActiveNotification($perPage,$select=['*'])
    {
        return Notification::with(['notifiedUsers' => function($query){
                    $query->where('user_id',getAuthUserCode());
                }
            ])
            ->select($select)
            ->where('is_active',self::ACTIVE)
            ->where('type','general')
            ->whereNotNull('notification_publish_date')
            ->orWhereHas('notifiedUsers',function($query){
                $query->where('user_id',getAuthUserCode());
            })
            ->where('notification_publish_date','>=',Carbon::now()->subDays(30))
            ->orderBy('notification_publish_date','Desc')
            ->paginate($perPage);
---
select * from `user_notifications` where `user_notifications`.`notification_id` in (5460) and `user_id` = 351