app/Repositories/ProjectRepository.php

    public function getAllProjectDetailForDashboardCard()
    {
        return Project::selectRaw('status, count(*) as count')
            ->where('is_active', 1)
            ->groupBy('status')
            ->pluck('count', 'status')
            ->toArray();
---
select status, count(*) as count from `projects` where `is_active` = 1 group by `status`

    public function getAllActiveProjectsOfEmployee($employeeId,$select,$with)
    {
        return Project::select($select)->with($with)
            ->where(function($query) use ($employeeId){
                $query->whereHas('assignedMembers',function($subQuery) use ($employeeId){
                    $subQuery->where('member_id', $employeeId)
                        ->where('assignable_type','project');
                })
                ->orWhereHas('projectLeaders', function ($subQuery) use ($employeeId) {
                    $subQuery->where('leader_id', $employeeId);
                });
            })
            ->where('is_active',1)
            ->get();
---
select * from `projects` where (exists (select * from `assigned_members` where `projects`.`id` = `assigned_members`.`assignable_id` and `assigned_members`.`assignable_type` = 'project' and `member_id` = 138 and `assignable_type` = 'project' and exists (select * from `users` where `assigned_members`.`member_id` = `users`.`id` and `users`.`deleted_at` is null)) or exists (select * from `project_team_leaders` where `projects`.`id` = `project_team_leaders`.`project_id` and `leader_id` = 138 and exists (select * from `users` where `project_team_leaders`.`leader_id` = `users`.`id` and `users`.`deleted_at` is null))) and `is_active` = 1 and exists (select * from `branches` where `projects`.`branch_id` = `branches`.`id` and `id` = 2 and `id` = 2)