app/Repositories/TaskRepository.php

    public function getAllTaskDetailForPieChart()
    {
        return Task::selectRaw('status, count(*) as count')
            ->where('is_active', 1)
            ->groupBy('status')
            ->pluck('count', 'status')
            ->toArray();
---
select status, count(*) as count from `tasks` where `is_active` = 1 group by `status`