app/Repositories/TimeLeaveRepository.php

select * from `time_leaves` where date(`issue_date`) = '2026-04-17' and `status` = 'approved' and `requested_by` = 99 and exists (select * from `branches` where `time_leaves`.`branch_id` = `branches`.`id` and `id` = 1 and `id` = 1) limit 1
---
    public function getEmployeeApprovedTimeLeave($date, $userId='')
    {
        $timeLeave =  TimeLeave::query()
            ->whereDate('issue_date', $date)
            ->where('status', LeaveStatusEnum::approved->value);

        if(!empty($userId)){
            $timeLeave = $timeLeave->where('requested_by', $userId);
        }else{
            $timeLeave = $timeLeave->where('requested_by', getAuthUserCode());
        }

        return $timeLeave->first();

select 0 as leave_type_id, 'Time Leave' as leave_type_name, 'time-leave' as leave_type_slug, 0 as total_leave_allocated, COUNT(time_leaves.id) as leave_taken from `time_leaves` where `time_leaves`.`requested_by` = 447 and `time_leaves`.`status` = 'approved' and year(`time_leaves`.`issue_date`) = '2026-04-17' and exists (select * from `branches` where `time_leaves`.`branch_id` = `branches`.`id` and `id` = 2 and `id` = 2) limit 1
---
    public function getTimeLeaveWithLeaveTakenbyEmployee($filterParameters)
    {

        $query = TimeLeave::query()
            ->addSelect(DB::raw("0 as leave_type_id"))
            ->addSelect(DB::raw("'Time Leave' as leave_type_name"))
            ->addSelect(DB::raw("'time-leave' as leave_type_slug"))
            ->addSelect(DB::raw("0 as total_leave_allocated"))
            ->selectRaw('COUNT(time_leaves.id) as leave_taken')

            ->where("time_leaves.requested_by", getAuthUserCode())
            ->where("time_leaves.status", 'approved');

        if (isset($filterParameters['start_date'])) {
            $query->whereBetween('time_leaves.issue_date', [$filterParameters['start_date'], $filterParameters['end_date']]);
        } else {
            $query->whereYear('time_leaves.issue_date', $filterParameters['year']);
        }

        return $query->first();