app/Repositories/TrainingRepository.php

select * from `trainings` where ((exists (select * from `employee_trainings` where `trainings`.`id` = `employee_trainings`.`training_id` and `employee_id` = 418) or exists (select * from `training_instructors` where `trainings`.`id` = `training_instructors`.`training_id` and exists (select * from `trainers` where `training_instructors`.`trainer_id` = `trainers`.`id` and `employee_id` = 418 and exists (select * from `branches` where `trainers`.`branch_id` = `branches`.`id` and `id` = 2 and `id` = 2)))) and `start_date` >= '2026-04-17 00:00:00' or (`start_date` <= '2026-04-17 00:00:00' and `end_date` >= '2026-04-17 00:00:00')) and exists (select * from `branches` where `trainings`.`branch_id` = `branches`.`id` and `id` = 2 and `id` = 2) limit 1
---
     public function getRecentTraining($select,$with, $employeeId = 0)
    {
        $recentTraining =  Training::select($select)
            ->with($with);
            if($employeeId != 0){
                $recentTraining = $recentTraining->where(function ($query) use ($employeeId) {
                    // Get trainings where user is either a trainee or a trainer
                    $query->whereHas('employeeTraining', function ($employeeQuery) use ($employeeId) {
                        $employeeQuery->where('employee_id', $employeeId);
                    })
                        ->orWhereHas('trainingInstructor', function ($trainerQuery) use ($employeeId) {
                            $trainerQuery->whereHas('trainer', function ($trainerNestedQuery) use ($employeeId) {
                                $trainerNestedQuery->where('employee_id', $employeeId);
                            });
                        });
                });
            }

            return $recentTraining->where('start_date', '>=', Carbon::today())
                ->orWhere(function ($query) {
                    $query->where('start_date', '<=', Carbon::today()) // Condition 2a: Training started already
                    ->where('end_date', '>=', Carbon::today()); // Condition 2b: Training is still ongoing
                })
            ->first();

select COUNT(DISTINCT trainings.id) as upcoming_training from `trainings` where (exists (select * from `employee_trainings` where `trainings`.`id` = `employee_trainings`.`training_id` and `employee_id` = 418) or exists (select * from `training_instructors` where `trainings`.`id` = `training_instructors`.`training_id` and exists (select * from `trainers` where `training_instructors`.`trainer_id` = `trainers`.`id` and `employee_id` = 418 and exists (select * from `branches` where `trainers`.`branch_id` = `branches`.`id` and `id` = 2 and `id` = 2)))) and (`trainings`.`start_date` >= '2026-04-17 00:00:00' or (`trainings`.`start_date` <= '2026-04-17 00:00:00' and `trainings`.`end_date` >= '2026-04-17 00:00:00')) and exists (select * from `branches` where `trainings`.`branch_id` = `branches`.`id` and `id` = 2 and `id` = 2) limit 1
---
    public function getTrainingSummary($employeeId)
    {
        return Training::select(DB::raw('COUNT(DISTINCT trainings.id) as upcoming_training'))
            ->where(function ($query) use ($employeeId) {
                $query->whereHas('employeeTraining', function ($employeeQuery) use ($employeeId) {
                    $employeeQuery->where('employee_id', $employeeId);
                })
                    ->orWhereHas('trainingInstructor', function ($trainerQuery) use ($employeeId) {
                        $trainerQuery->whereHas('trainer', function ($trainerNestedQuery) use ($employeeId) {
                            $trainerNestedQuery->where('employee_id', $employeeId);
                        });
                    });
            })->where(function ($query) {
                $query->where('trainings.start_date', '>=', Carbon::today())
                    ->orWhere(function ($query) {
                        $query->where('trainings.start_date', '<=', Carbon::today()) // Condition 2a: Training started already
                        ->where('trainings.end_date', '>=', Carbon::today()); // Condition 2b: Training is still ongoing
                    });
            })->first();