app/Repositories/UserRepository.php

    public function update($userDetail, $validatedData)
    {
        if (isset($validatedData['avatar'])) {
            if ($userDetail['avatar']) {
                $this->removeImage(User::AVATAR_UPLOAD_PATH, $userDetail['avatar']);
            }
            $validatedData['avatar'] = $this->storeImage($validatedData['avatar'], User::AVATAR_UPLOAD_PATH, 500, 500);
        }
        return $userDetail->update($validatedData);
---
update `users` set `uuid` = 'iPhone:5B317973-22BD-4E0A-9600-5325270BCD38', `fcm_token` = 'dwF8Gxtpj0gIkz5ggLTTtz:APA91bF-CBqyzg8gSGXjwomgtsOk75uDGBVopwT8CvyT9vMBxUs3PLyvhBIpHPhd7QcWUKdfSjnhwOUTcndfCS2AKKgLQkmHcpwNVuDl5ZC7v_pHjGyd4Jw', `users`.`updated_at` = '2026-04-17 07:53:32' where `id` = 372

    public function findUserDetailById($id, $select = ['*'], $with = [])
    {
        return User::with($with)->select($select)->where('id', $id)->first();
---
select `users`.*, `branch_id`, `company_id`, `department_id`, `post_id`, `role_id` from `users` where `id` = 418 and `users`.`deleted_at` is null limit 1

    public function updateUserOnlineStatus($userDetail, $loginStatus)
    {
        return $userDetail->update([
            'online_status' => $loginStatus,
        ]);
---
update `users` set `online_status` = 1, `users`.`updated_at` = '2026-04-17 08:05:21' where `id` = 99

    public function getUserByUserName($userName, $select = ['*'])
    {
        return User::select($select)
            ->where('username', $userName)
            ->where('is_active', self::IS_ACTIVE)
            ->where('status', 'verified')
---
select * from `users` where `username` = 'KY0115' and `is_active` = 1 and `status` = 'verified' and `users`.`deleted_at` is null limit 1

    public function getUserByUserEmail($userEmail, $select = ['*'])
    {
        return User::select($select)
            ->where('email', $userEmail)
            ->where('is_active', self::IS_ACTIVE)
            ->where('status', 'verified')
            ->first();
---
select * from `users` where `email` = 'KY0115' and `is_active` = 1 and `status` = 'verified' and `users`.`deleted_at` is null limit 1

    public function getAllActiveEmployeeOfDepartment($departmentId,$select = ['*'], $with=[])
    {
        return User::select($select)
            ->with($with)
            ->where('status', 'verified')
            ->where('is_active', self::IS_ACTIVE)
            ->where('department_id', $departmentId)
            ->orderBy('online_status','desc')
            ->where('id','!=', getAuthUserCode())
            ->get();
---
select * from `users` where `status` = 'verified' and `is_active` = 1 and `department_id` = 27 and `id` != 418 and `users`.`deleted_at` is null order by `online_status` desc

    public function getLocationLogs($filterData)
    {
        if(AppHelper::ifDateInBsEnabled()){
            $filterData['date'] = isset($filterData['date']) ?
                AppHelper::dateInYmdFormatNepToEng($filterData['date']): null;

        }
        $query = EmployeeLocation::with(['employee'])
            ->whereHas('employee', function ($query) {
                $query->where('is_active', 1);
            })
            ->when(isset($filterData['branch_id']), function ($query) use ($filterData) {
                $query->whereHas('employee', function ($query) use ($filterData) {
                    $query->where('branch_id', $filterData['branch_id']);
                });
            })
            ->when(isset($filterData['department_id']), function ($query) use ($filterData) {
                $query->whereHas('employee', function ($query) use ($filterData) {
                    $query->where('department_id', $filterData['department_id']);
                });
            })
            ->when(isset($filterData['employee_id']), function ($query) use ($filterData) {
                $query->where('employee_id', $filterData['employee_id']);
            })
            ->when(isset($filterData['date']), function ($query) use ($filterData) {
                $query->whereDate('created_at', $filterData['date']);
            });

        // Group by employee_id
        return $query->get()->groupBy('employee_id');
---
select * from `employee_locations` where `id` = 911 limit 1

    public function setEmployeeLocation($validatedData)
    {
        return EmployeeLocation::create($validatedData)->fresh();
---
insert into `employee_locations` (`latitude`, `longitude`, `employee_id`, `updated_at`, `created_at`) values (null, null, 99, '2026-04-17 08:05:21', '2026-04-17 08:05:21')